In [1]:
#Import Libraries 
import pandas as pd 
import numpy as np
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [2]:
#Load Data
data=pd.read_csv("C:\\Users\\busra\\OneDrive\\Masaüstü\\gender.csv")

In [3]:
data.head()

,Gender,Age,Height (cm),Weight (kg),Occupation,Education Level,Marital Status,Income (USD),Favorite Color,Unnamed: 9
0,male,32,175,70,Software Engineer,Master's Degree,Married,75000,Blue,NaN
1,male,25,182,85,Sales Representative,Bachelor's Degree,Single,45000,Green,NaN
2,female,41,160,62,Doctor,Doctorate Degree,Married,120000,Purple,NaN
3,male,38,178,79,Lawyer,Bachelor's Degree,Single,90000,Red,NaN
4,female,29,165,58,Graphic Designer,Associate's Degree,Single,35000,Yellow,NaN

In [4]:
data.tail()

,Gender,Age,Height (cm),Weight (kg),Occupation,Education Level,Marital Status,Income (USD),Favorite Color,Unnamed: 9
126,female,32,170,64,Nurse,Associate's Degree,Single,60000,Orange,NaN
127,male,38,176,79,Project Manager,Bachelor's Degree,Married,90000,Black,NaN
128,female,27,162,55,Graphic Designer,Associate's Degree,Single,55000,Green,NaN
129,male,33,175,77,Sales Representative,Bachelor's Degree,Married,80000,Yellow,NaN
130,female,29,164,57,Software Developer,Bachelor's Degree,Single,65000,Blue,NaN

In [5]:
data.columns    #There is 1 tab space in front of each column

Index([' Gender', ' Age', ' Height (cm)', ' Weight (kg)', ' Occupation',
       ' Education Level', ' Marital Status', ' Income (USD)',
       ' Favorite Color', 'Unnamed: 9'],
      dtype='object')

In [6]:
data.describe()

              Age   Height (cm)   Weight (kg)   Income (USD)  Unnamed: 9
count  131.000000    131.000000    131.000000     131.000000         0.0
mean    34.564885    173.198473     71.458015   93206.106870         NaN
std      5.984723      8.045467     12.648052   74045.382919         NaN
min     24.000000    160.000000     50.000000   30000.000000         NaN
25%     29.000000    166.000000     60.000000   55000.000000         NaN
50%     34.000000    175.000000     75.000000   75000.000000         NaN
75%     39.000000    180.500000     83.000000  100000.000000         NaN
max     52.000000    190.000000     94.000000  500000.000000         NaN

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 131 entries, 0 to 130
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0    Gender           131 non-null    object
 1    Age              131 non-null    int64
 2    Height (cm)      131 non-null    int64
 3    Weight (kg)      131 non-null    int64
 4    Occupation       131 non-null    object
 5    Education Level  131 non-null    object
 6    Marital Status   131 non-null    object
 7    Income (USD)     131 non-null    int64
 8    Favorite Color   131 non-null    object
 9   Unnamed: 9        0 non-null      float64
dtypes: float64(1), int64(4), object(5)
memory usage: 10.4+ KB

In [8]:
data.shape

(131, 10)

In [9]:
data.isnull().sum()

 Gender               0
 Age                  0
 Height (cm)          0
 Weight (kg)          0
 Occupation           0
 Education Level      0
 Marital Status       0
 Income (USD)         0
 Favorite Color       0
Unnamed: 9          131
dtype: int64

In [10]:
data[" Occupation"].value_counts()

Teacher                  7
Nurse                    6
Writer                   6
Project Manager          6
Marketing Specialist     6
Lawyer                   6
Graphic Designer         6
Doctor                   6
Engineer                 6
 Teacher                 5
Architect                4
Sales Representative     4
IT Manager               4
 Writer                  3
 Sales Representative    3
Business Analyst         3
Accountant               3
CEO                      3
 IT Manager              3
 Analyst                 3
 Nurse                   3
 Architect               3
 Accountant              3
 Engineer                3
 Project Manager         3
 CEO                     3
 Marketing Specialist    3
Analyst                  3
 Graphic Designer        3
 Lawyer                  3
 Doctor                  3
 Business Analyst        2
 Software Engineer       1
 Business Consultant     1
Software Developer       1
Name:  Occupation, dtype: int64

In [11]:
data.drop(columns=['Unnamed: 9',' Favorite Color', " Occupation"],axis=1,inplace=True)

In [12]:
data.head()

,Gender,Age,Height (cm),Weight (kg),Education Level,Marital Status,Income (USD)
0,male,32,175,70,Master's Degree,Married,75000
1,male,25,182,85,Bachelor's Degree,Single,45000
2,female,41,160,62,Doctorate Degree,Married,120000
3,male,38,178,79,Bachelor's Degree,Single,90000
4,female,29,165,58,Associate's Degree,Single,35000

In [13]:
data[" Education Level"].value_counts()

Bachelor's Degree      49
 Bachelor's Degree     29
Associate's Degree     12
 Master's Degree       10
Master's Degree        10
Doctorate Degree        9
 Doctorate Degree       6
 Associate's Degree     6
Name:  Education Level, dtype: int64

In [18]:
data.replace({" Education Level":{"Bachelor's Degree":1," Bachelor's Degree":1,"Associate's Degree":2," Associate's Degree":2,
                                 " Master's Degree":3,"Master's Degree":3,"Doctorate Degree":4," Doctorate Degree":4}},inplace=True)

Education Level
- 1-->Bachelor's Degree
- 2-->Associate's Degree
- 3-->Master's Degree
- 4-->Doctorate Degree

In [20]:
data.head()

,Gender,Age,Height (cm),Weight (kg),Education Level,Marital Status,Income (USD)
0,male,32,175,70,3,Married,75000
1,male,25,182,85,1,Single,45000
2,female,41,160,62,4,Married,120000
3,male,38,178,79,1,Single,90000
4,female,29,165,58,2,Single,35000

In [16]:
data[" Marital Status"].value_counts()

Married      41
Single       38
 Married     24
 Single      21
 Divorced     4
 Widowed      2
Divorced      1
Name:  Marital Status, dtype: int64

In [21]:
data.replace({" Marital Status":{"Married":1," Married":1,"Single":2," Single":2,"Divorced":3," Divorced":3," Widowed":4}},inplace=True)

Marital Status
- 1-->Married
- 2-->Single
- 3-->Divorced
- 4-->Widowed

In [22]:
data.head()

,Gender,Age,Height (cm),Weight (kg),Education Level,Marital Status,Income (USD)
0,male,32,175,70,3,1,75000
1,male,25,182,85,1,2,45000
2,female,41,160,62,4,1,120000
3,male,38,178,79,1,2,90000
4,female,29,165,58,2,2,35000

In [23]:
data[" Gender"].value_counts()

male       41
female     39
 male      27
 female    24
Name:  Gender, dtype: int64

In [27]:
data.replace({" Gender":{"male":0," male":0,"female":1," female":1}},inplace=True)

Gender 
- 0-->MALE
- 1-->FEMALE

In [25]:
data.head()

,Gender,Age,Height (cm),Weight (kg),Education Level,Marital Status,Income (USD)
0,0,32,175,70,3,1,75000
1,0,25,182,85,1,2,45000
2,1,41,160,62,4,1,120000
3,0,38,178,79,1,2,90000
4,1,29,165,58,2,2,35000

In [28]:
#Split Data into Targets and Features
X=data.drop(columns=" Gender",axis=1)
Y=data[" Gender"]

In [29]:
print(X)

      Age   Height (cm)   Weight (kg)   Education Level   Marital Status  \
0      32           175            70                 3                1
1      25           182            85                 1                2
2      41           160            62                 4                1
3      38           178            79                 1                2
4      29           165            58                 2                2
..    ...           ...           ...               ...              ...
126    32           170            64                 2                2
127    38           176            79                 1                1
128    27           162            55                 2                2
129    33           175            77                 1                1
130    29           164            57                 1                2

      Income (USD)
0            75000
1            45000
2           120000
3            90000
4            35000
..             ...
126          60000
127          90000
128          55000
129          80000
130          65000

[131 rows x 6 columns]

In [30]:
print(Y)

0      0
1      0
2      1
3      0
4      1
      ..
126    1
127    0
128    1
129    0
130    1
Name:  Gender, Length: 131, dtype: int64

In [32]:
#Split Data Train and Test
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.2,random_state=1)

In [34]:
print(X.shape ,X_train.shape, X_test.shape)

(131, 6) (104, 6) (27, 6)

In [35]:
print(Y.shape ,Y_train.shape, Y_test.shape)

(131,) (104,) (27,)

In [40]:
#Logistic Regression 
model=LogisticRegression()
model.fit(X_train,Y_train)

LogisticRegression()

In [41]:
#Accuracy on Train Data
X_train_predict=model.predict(X_train)
X_train_score=accuracy_score(X_train_predict,Y_train)
print("Accuracy on train data {}".format(X_train_score))

Accuracy on training data 1.0

In [42]:
#Accuracy on Test Data
X_test_predict=model.predict(X_test)
X_test_score=accuracy_score(X_test_predict,Y_test)
print("Accuracy on test data {}".format(X_test_score))

Accuracy on test data 1.0